{
  "topics": {
    "wisdom": [
      {
        "text": "The mind is everything. What you think, you become.",
        "source": "Inspired by Dhammapada, adapted for Hindu context",
        "reflection": "What thoughts will you cultivate today to shape your destiny?",
        "god": "Divine Wisdom"
      },
      {
        "text": "Truth alone triumphs, not falsehood.",
        "source": "Mundaka Upanishad 3.1.6",
        "reflection": "How can you align your actions with truth today?",
        "god": "Universal Truth"
      },
      { "text": "Surrender to the Divine with unwavering faith, and grace shall follow.", 
        "source": "Ramayan - Hanuman's devotion",
        "god": "Lord Hanuman",
        "reflection": "What does surrender mean to you in your spiritual journey?"},
        {"text": "Truth and righteousness triumph over evil.", 
        "source": "Ramayan - Victory of Rama" 
        ,"reflection": "How can you embody truth and righteousness in your life?",
        "god": "Lord Rama"
        },
    {   "text": "Perform your duties selflessly, as an offering to the Lord.", 
        "source": "Ramayan - Bharata's rule",
        "reflection": "How can you serve others without attachment to results?",
        "god": "Lord Rama"
    }
  

    ],
    "duty": [
      {
        "text": "You have the right to perform your prescribed duty, but you are not entitled to the fruits of action.",
        "source": "Bhagavad Gita 2.47",
        "reflection": "How can you focus on your duties without attachment to results?",
        "god": "Lord Krishna"
      },
      {
        "text": "It is better to perform one's own duties imperfectly than to perform the duties of another perfectly.",
        "source": "Bhagavad Gita 3.35",
        "reflection": "What is your unique purpose (svadharma) that only you can fulfill?",
        "god": "Lord Krishna"
      }
    ],
    "valor": [
      {
        "text": "One should never engage in action for the sake of rewards, nor should one be addicted to inaction.",
        "source": "Bhagavad Gita 3.19",
        "reflection": "What righteous action calls to you today, regardless of outcome?",
        "god": "Lord Rama"
      },
      {
        "text": "The power of righteousness is greater than the power of might.",
        "source": "Ramayanam, Yuddha Kanda",
        "reflection": "How can you use your strength for dharma today?",
        "god": "Lord Rama"
      }
    ],
    "rituals": [
      {
        "text": "The whole universe is a manifestation of the Divine. All actions should be done as offerings to that Divine.",
        "source": "Isha Upanishad",
        "reflection": "How can you make your daily activities into sacred rituals?",
        "god": "Vedic Sages"
      },
      {
        "text": "May good thoughts come to us from all sides, forever and ever.",
        "source": "Rigveda 10.191.4",
        "reflection": "What sacred intention will guide your day?",
        "god": "Vedic Sages"
      }
    ],
    "peace": [
      {
        "text": "That is perfect. This is perfect. Perfect comes from perfect. Take perfect from perfect, the remainder is perfect.",
        "source": "Isha Upanishad",
        "reflection": "How does recognizing the perfection in all things bring you peace?",
        "god": "Divine Consciousness"
      },
      {
        "text": "When the mind becomes silent, the Self reveals itself.",
        "source": "Katha Upanishad",
        "reflection": "What practice will help you quiet your mind today?",
        "god": "Divine Consciousness"
      }
    ],
    "transformation": [
      {
        "text": "As a person puts on new garments, giving up old ones, the soul similarly accepts new material bodies, giving up the old and useless ones.",
        "source": "Bhagavad Gita 2.22",
        "reflection": "What old patterns are you ready to release for your transformation?",
        "god": "Lord Shiva"
      },
      {
        "text": "The Divine is the source of all creation and dissolution.",
        "source": "Shvetashvatara Upanishad",
        "reflection": "How can you embrace both creation and letting go in your life?",
        "god": "Lord Shiva"
      }
    ],
    "protection": [
      {
        "text": "Whenever there is a decline in righteousness and an increase in unrighteousness, I manifest myself.",
        "source": "Bhagavad Gita 4.7",
        "reflection": "How can you be an instrument of preservation and protection today?",
        "god": "Lord Vishnu"
      },
      {
        "text": "The Lord sustains all beings, as a thread supports a necklace of pearls.",
        "source": "Vishnu Sahasranama",
        "reflection": "How does recognizing the unity of all existence change your perspective?",
        "god": "Lord Vishnu"
      }
    ],
    "positive": [
      {
        "text": "The soul is eternal, all-pervading, unchangeable, immovable, and primordial.",
        "source": "Bhagavad Gita 2.24",
        "reflection": "How does knowing your eternal nature bring you peace today?",
        "god": "Divine Wisdom",
        "theme": "uplifting"
      },
      {
        "text": "May we hear with our ears what is auspicious. May we see with our eyes what is auspicious.",
        "source": "Shanti Mantra, Upanishads",
        "reflection": "What blessings will you seek and acknowledge today?",
        "god": "Divine Blessings",
        "theme": "uplifting"
      },
      {
        "text": "The happiness which comes from long practice, which leads to the end of suffering, which at first is like poison but at last like nectar - this kind of happiness arises from the tranquility of one's own mind.",
        "source": "Bhagavad Gita 18.37",
        "reflection": "What practice will you commit to for lasting happiness?",
        "god": "Lord Krishna",
        "theme": "uplifting"
      },
      {
        "text": "The wise see the same Divine in a learned priest, a cow, an elephant, a dog, and a dog-eater.",
        "source": "Bhagavad Gita 5.18",
        "reflection": "How will you practice seeing the divine in everyone today?",
        "god": "Universal Vision",
        "theme": "uplifting"
      }
    ]
  }
}